Autodesk.Revit.DB.RoutingPreferenceRuleGroupType
Since:
2013
Add more rule group type here.
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceRuleGroupType.Caps
The cap types

Autodesk.Revit.DB.RoutingPreferenceRuleGroupType.TransitionsOvalToRound
The multi-shape transition from the oval profile to the round profile.

Autodesk.Revit.DB.RoutingPreferenceRuleGroupType.TransitionsRectangularToOval
The multi-shape transition from the rectangular profile to the oval profile.

Autodesk.Revit.DB.RoutingPreferenceRuleGroupType.TransitionsRectangularToRound
The multi-shape transition from the rectangular profile to the round profile.

Autodesk.Revit.DB.RoutingPreferenceRuleGroupType.MechanicalJoints
The mechanical joint types that connect fitting to fitting, segment to fitting, or segment to segment.

Autodesk.Revit.DB.RoutingPreferenceRuleGroupType.Unions
The union types that connect two segments together.

Autodesk.Revit.DB.RoutingPreferenceRuleGroupType.Transitions
The transition types (Note that the multi-shape transitions may have their own groups).

Autodesk.Revit.DB.RoutingPreferenceRuleGroupType.Crosses
The cross types.

Autodesk.Revit.DB.RoutingPreferenceRuleGroupType.Junctions
The junction types (e.g. takeoff, tee, wye, tap).

Autodesk.Revit.DB.RoutingPreferenceRuleGroupType.Elbows
The elbow types.

Autodesk.Revit.DB.RoutingPreferenceRuleGroupType.Segments
The segment types (e.g. pipe stocks)

Autodesk.Revit.DB.RoutingPreferenceRuleGroupType.Undefined
The undefined group type, the default initial value.